:PROPERTIES:
:ID:       3D591887-9B7F-4D41-A7D0-5230F06A4D51
:END:
#+title: plantuml

PlantUML is a UML oriented diagram as code tool.

Mermaid is probably more popular nowadays, and more flexible, but
PlantUML supports some cases better, has more built-in support in
[[id:04B03591-50E7-41E2-A2A5-0C2893FAD39C][org-babel]], and avoids the [[id:F974B544-7B68-42E0-8978-DF4D1DECACA1][browser-sledgehammer]].

* Installation

plantuml is primarily distributed as a JAR, but also includes a
directly executable wrapper.

#+begin_src shell :results output
  plantuml --version
#+end_src

#+RESULTS:
#+begin_example
PlantUML version 1.2026.6 / 6287b33 [2026-06-08 16:02:56 UTC]
(GPL source distribution)

Build Version: 1.2026.6
Git Commit: 6287b33
Compile Time: 2026-06-08 16:02:56 UTC

Java Runtime: OpenJDK Runtime Environment
JVM: OpenJDK 64-Bit Server VM
Default Encoding: UTF-8
Language: en
Country: US
 
PLANTUML_LIMIT_SIZE: 4096

GraphViz: dot - graphviz version 15.0.0 (20260523.1842)
Installation seems OK. File generation OK
#+end_example

** [[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]]

*** [[id:61678BF7-A363-45C2-A3E2-54A1EB15EF68][brew]]

#+begin_src shell :async :session brew
  brew install plantuml --yes
#+end_src

#+RESULTS:
: 95f67eea-d4db-434b-9c59-6a62a7910798

* Help

#+begin_src shell :results output
  plantuml --help
#+end_src

#+RESULTS:
#+begin_example
plantuml - generate diagrams from plain text

Usage:
  java -jar plantuml.jar [options] [file|dir]...
  java -jar plantuml.jar [options] --gui

Description:
  Process PlantUML sources from files, directories (optionally recursive), or stdin (-pipe).

Wildcards (for files/dirs):
  ,*   any characters except '/' and '\'
  ?   exactly one character except '/' and '\'
  ,**  any characters across directories (recursive)
  Tip: quote patterns to avoid shell expansion (e.g., "**/*.puml").

General:

General:
     --author .................... Show information about PlantUML authors
     --check-graphviz ............ Check Graphviz installation
     --dark-mode ................. Render diagrams in dark mode
 -d, --define <VAR>=<value> ...... Define a preprocessing variable (equivalent to '!define <var> <value>')
     --duration .................. Print total processing time
     --gui ....................... Launch the graphical user interface
 -h, --help ...................... Show help and usage information
     --help-more ................. Show extended help (advanced options)
     --http-server[:<port>] ...... Start internal HTTP server for rendering (default port : 8080)
 -p, --pipe ...................... Read source from stdin, write result to stdout
     --progress-bar .............. Show a textual progress bar
     --splash-screen ............. Show splash screen with progress bar
 -v, --verbose ................... Enable verbose logging
     --version ................... Show PlantUML and Java version

Execution control:
     --check-before-run .......... Pre-check syntax of all inputs and stop faster on error
     --check-syntax .............. Check diagram syntax without generating images
     --no-error-image ............ Do not generate error images for diagrams with syntax errors
     --stop-on-error ............. Stop at the first syntax error

Metadata & assets:
     --extract-source ............ Extract embedded PlantUML source from PNG or SVG metadata
     --skip-fresh ................ Skip PNG/SVG files that are already up-to-date (using metadata)
     --sprite <4|8|16[z]> <file>   Encode a sprite definition from an image file

Output format (choose one):
 -f, --format <name> ............. Set the output format for generated diagrams
                                   (e.g. png, svg, pdf, eps, latex, txt, utxt, obfuscate, preproc...)

Available formats:
     --eps ....................... Generate images in EPS format
     --latex ..................... Generate LaTeX/TikZ output
     --obfuscate ................. Replace text in diagrams with obfuscated strings to share diagrams safely
     --png ....................... Generate PNG images (default)
     --preproc ................... Generate the preprocessed source after applying !include, !define... (no rendering)
     --svg ....................... Generate SVG images
     --txt ....................... Generate ASCII art diagrams
     --utxt ...................... Generate ASCII art diagrams using Unicode characters


Examples:
  # Process all .puml recursively
  java -jar plantuml.jar "**/*.puml"

  # Check syntax only (CI)
  java -jar plantuml.jar --check-syntax src/diagrams

  # Read from stdin and write to stdout (SVG)
  cat diagram.puml | java -jar plantuml.jar --svg -pipe > out.svg

  # Encode a sprite from an image
  java -jar plantuml.jar --sprite 16z myicon.png

  # Use a define
  java -jar plantuml.jar -DAUTHOR=John diagram.puml

  # Change output directory
  java -jar plantuml.jar --format svg --output-dir out diagrams/

Exit codes:
  0    Success
  50   No file found
  100  No diagram found in file(s)
  200  Some diagrams have syntax errors

See also:
  java -jar plantuml.jar --help-more
  Documentation: https://plantuml.com
#+end_example

* Example

#+name: sample
#+begin_example
@startuml
Alice->Bob : Hello
return ok
@enduml
#+end_example

#+begin_src shell :stdin sample :session puml :async :results output
  plantuml --utxt --pipe
#+end_src

#+RESULTS:
#+begin_example
     ┌─────┐          ┌───┐
     │Alice│          │Bob│
     └──┬──┘          └─┬─┘
        │    Hello      │  
        │──────────────>│  
        │               │  
        │      ok       │  
        │<─ ─ ─ ─ ─ ─ ─ │  
     ┌──┴──┐          ┌─┴─┐
     │Alice│          │Bob│
     └─────┘          └───┘
#+end_example

* Through Python
:PROPERTIES:
:header-args: :header-args: :session lc_puml :var venv="/tmp/lc_puml" :python /tmp/lc_puml/bin/python :async :results output
:END:

Expose functionality through python.

#+begin_src python
  import subprocess

  def render_utxt(diagram: str) -> str:
      """Render provided PlantUML digram string as unicode text."""
      resp = subprocess.run(["plantuml", "--utxt", "--pipe"],input=diagram,capture_output=True,text=True)
      if resp.returncode == 0:
          return resp.stdout
      else:
          raise resp.stderr
#+end_src

#+RESULTS:

#+begin_src python :var diagram=sample
  print(render_utxt(diagram))
#+end_src

#+RESULTS:
#+begin_example
┌─────┐          ┌───┐
     │Alice│          │Bob│
     └──┬──┘          └─┬─┘
        │    Hello      │  
        │──────────────>│  
        │               │  
        │      ok       │  
        │<─ ─ ─ ─ ─ ─ ─ │  
     ┌──┴──┐          ┌─┴─┐
     │Alice│          │Bob│
     └─────┘          └───┘
#+end_example

** Tool

Expose as a tool using langchain.

#+begin_src shell
  python -m venv ${venv}
  ${venv}/bin/python -m pip install langchain-ollama deepagents
#+end_src

#+RESULTS:
#+begin_example
venv='/tmp/lc_puml'
python -m venv ${venv}
${venv}/bin/python -m pip install langchain-ollama deepagents
Requirement already satisfied: langchain-ollama in /private/tmp/lc_puml/lib/python3.14/site-packages (1.1.0)
Requirement already satisfied: deepagents in /private/tmp/lc_puml/lib/python3.14/site-packages (0.6.11)
Requirement already satisfied: langchain-core<2.0.0,>=1.2.21 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-ollama) (1.4.8)
Requirement already satisfied: ollama<1.0.0,>=0.6.1 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-ollama) (0.6.2)
Requirement already satisfied: jsonpatch<2.0.0,>=1.33.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (1.33)
Requirement already satisfied: langchain-protocol>=0.0.17 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.0.18)
Requirement already satisfied: langsmith<1.0.0,>=0.3.45 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.8.18)
Requirement already satisfied: packaging>=23.2.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (26.2)
Requirement already satisfied: pydantic<3.0.0,>=2.7.4 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (2.13.4)
Requirement already satisfied: pyyaml<7.0.0,>=5.3.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (6.0.3)
Requirement already satisfied: tenacity!=8.4.0,<10.0.0,>=8.1.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (9.1.4)
Requirement already satisfied: typing-extensions<5.0.0,>=4.7.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (4.15.0)
Requirement already satisfied: uuid-utils<1.0,>=0.12.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.16.2)
Requirement already satisfied: jsonpointer>=1.9 in /private/tmp/lc_puml/lib/python3.14/site-packages (from jsonpatch<2.0.0,>=1.33.0->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (3.1.1)
Requirement already satisfied: httpx<1,>=0.23.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.28.1)
Requirement already satisfied: orjson>=3.9.14 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (3.11.9)
Requirement already satisfied: requests-toolbelt>=1.0.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (1.0.0)
Requirement already satisfied: requests>=2.0.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (2.34.2)
Requirement already satisfied: websockets>=15.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (15.0.1)
Requirement already satisfied: xxhash>=3.0.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (3.7.0)
Requirement already satisfied: zstandard>=0.23.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.25.0)
Requirement already satisfied: anyio in /private/tmp/lc_puml/lib/python3.14/site-packages (from httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (4.14.0)
Requirement already satisfied: certifi in /private/tmp/lc_puml/lib/python3.14/site-packages (from httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (2026.6.17)
Requirement already satisfied: httpcore==1.* in /private/tmp/lc_puml/lib/python3.14/site-packages (from httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (1.0.9)
Requirement already satisfied: idna in /private/tmp/lc_puml/lib/python3.14/site-packages (from httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (3.18)
Requirement already satisfied: h11>=0.16 in /private/tmp/lc_puml/lib/python3.14/site-packages (from httpcore==1.*->httpx<1,>=0.23.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.16.0)
Requirement already satisfied: annotated-types>=0.6.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from pydantic<3.0.0,>=2.7.4->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.7.0)
Requirement already satisfied: pydantic-core==2.46.4 in /private/tmp/lc_puml/lib/python3.14/site-packages (from pydantic<3.0.0,>=2.7.4->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (2.46.4)
Requirement already satisfied: typing-inspection>=0.4.2 in /private/tmp/lc_puml/lib/python3.14/site-packages (from pydantic<3.0.0,>=2.7.4->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (0.4.2)
Requirement already satisfied: langchain-anthropic<2.0.0,>=1.4.6 in /private/tmp/lc_puml/lib/python3.14/site-packages (from deepagents) (1.4.6)
Requirement already satisfied: langchain-google-genai<5.0.0,>=4.2.5 in /private/tmp/lc_puml/lib/python3.14/site-packages (from deepagents) (4.2.5)
Requirement already satisfied: langchain<2.0.0,>=1.3.9 in /private/tmp/lc_puml/lib/python3.14/site-packages (from deepagents) (1.3.10)
Requirement already satisfied: wcmatch>=10.1 in /private/tmp/lc_puml/lib/python3.14/site-packages (from deepagents) (10.1)
Requirement already satisfied: langgraph<1.3.0,>=1.2.5 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain<2.0.0,>=1.3.9->deepagents) (1.2.6)
Requirement already satisfied: anthropic<1.0.0,>=0.96.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-anthropic<2.0.0,>=1.4.6->deepagents) (0.111.0)
Requirement already satisfied: distro<2,>=1.7.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from anthropic<1.0.0,>=0.96.0->langchain-anthropic<2.0.0,>=1.4.6->deepagents) (1.9.0)
Requirement already satisfied: docstring-parser<1,>=0.15 in /private/tmp/lc_puml/lib/python3.14/site-packages (from anthropic<1.0.0,>=0.96.0->langchain-anthropic<2.0.0,>=1.4.6->deepagents) (0.18.0)
Requirement already satisfied: jiter<1,>=0.4.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from anthropic<1.0.0,>=0.96.0->langchain-anthropic<2.0.0,>=1.4.6->deepagents) (0.15.0)
Requirement already satisfied: sniffio in /private/tmp/lc_puml/lib/python3.14/site-packages (from anthropic<1.0.0,>=0.96.0->langchain-anthropic<2.0.0,>=1.4.6->deepagents) (1.3.1)
Requirement already satisfied: filetype<2.0.0,>=1.2.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-google-genai<5.0.0,>=4.2.5->deepagents) (1.2.0)
Requirement already satisfied: google-genai<3.0.0,>=1.65.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langchain-google-genai<5.0.0,>=4.2.5->deepagents) (2.9.0)
Requirement already satisfied: google-auth<3.0.0,>=2.48.1 in /private/tmp/lc_puml/lib/python3.14/site-packages (from google-auth[requests]<3.0.0,>=2.48.1->google-genai<3.0.0,>=1.65.0->langchain-google-genai<5.0.0,>=4.2.5->deepagents) (2.55.0)
Requirement already satisfied: pyasn1-modules>=0.2.1 in /private/tmp/lc_puml/lib/python3.14/site-packages (from google-auth<3.0.0,>=2.48.1->google-auth[requests]<3.0.0,>=2.48.1->google-genai<3.0.0,>=1.65.0->langchain-google-genai<5.0.0,>=4.2.5->deepagents) (0.4.2)
Requirement already satisfied: cryptography>=38.0.3 in /private/tmp/lc_puml/lib/python3.14/site-packages (from google-auth<3.0.0,>=2.48.1->google-auth[requests]<3.0.0,>=2.48.1->google-genai<3.0.0,>=1.65.0->langchain-google-genai<5.0.0,>=4.2.5->deepagents) (49.0.0)
Requirement already satisfied: langgraph-checkpoint<5.0.0,>=4.1.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langgraph<1.3.0,>=1.2.5->langchain<2.0.0,>=1.3.9->deepagents) (4.1.1)
Requirement already satisfied: langgraph-prebuilt<1.2.0,>=1.1.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langgraph<1.3.0,>=1.2.5->langchain<2.0.0,>=1.3.9->deepagents) (1.1.0)
Requirement already satisfied: langgraph-sdk<0.5.0,>=0.4.2 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langgraph<1.3.0,>=1.2.5->langchain<2.0.0,>=1.3.9->deepagents) (0.4.2)
Requirement already satisfied: ormsgpack>=1.12.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from langgraph-checkpoint<5.0.0,>=4.1.0->langgraph<1.3.0,>=1.2.5->langchain<2.0.0,>=1.3.9->deepagents) (1.12.2)
Requirement already satisfied: charset_normalizer<4,>=2 in /private/tmp/lc_puml/lib/python3.14/site-packages (from requests>=2.0.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (3.4.7)
Requirement already satisfied: urllib3<3,>=1.26 in /private/tmp/lc_puml/lib/python3.14/site-packages (from requests>=2.0.0->langsmith<1.0.0,>=0.3.45->langchain-core<2.0.0,>=1.2.21->langchain-ollama) (2.7.0)
Requirement already satisfied: cffi>=2.0.0 in /private/tmp/lc_puml/lib/python3.14/site-packages (from cryptography>=38.0.3->google-auth<3.0.0,>=2.48.1->google-auth[requests]<3.0.0,>=2.48.1->google-genai<3.0.0,>=1.65.0->langchain-google-genai<5.0.0,>=4.2.5->deepagents) (2.0.0)
Requirement already satisfied: pycparser in /private/tmp/lc_puml/lib/python3.14/site-packages (from cffi>=2.0.0->cryptography>=38.0.3->google-auth<3.0.0,>=2.48.1->google-auth[requests]<3.0.0,>=2.48.1->google-genai<3.0.0,>=1.65.0->langchain-google-genai<5.0.0,>=4.2.5->deepagents) (3.0)
Requirement already satisfied: pyasn1<0.7.0,>=0.6.1 in /private/tmp/lc_puml/lib/python3.14/site-packages (from pyasn1-modules>=0.2.1->google-auth<3.0.0,>=2.48.1->google-auth[requests]<3.0.0,>=2.48.1->google-genai<3.0.0,>=1.65.0->langchain-google-genai<5.0.0,>=4.2.5->deepagents) (0.6.3)
Requirement already satisfied: bracex>=2.1.1 in /private/tmp/lc_puml/lib/python3.14/site-packages (from wcmatch>=10.1->deepagents) (2.6)

[notice] A new release of pip is available: 26.1.1 -> 26.1.2
[notice] To update, run: /private/tmp/lc_puml/bin/python -m pip install --upgrade pip
[?2004hecho 'ob_comint_async_shell_end_434136d9-ae13-4152-aa6b-1d0b50efd35b'[?2004l
#+end_example

#+begin_src python
  from langchain.tools import tool

  @tool
  def puml_to_utext(diagram: str) -> str:
      """Return the PlantUML diagram rendered as unicode text."""
      return render_utxt(diagram)
#+end_src

#+RESULTS:

*** Sample

deepagents seems like overkill, but is apparently the currently captured route.

#+begin_src python
  from deepagents import create_deep_agent

  agent = create_deep_agent(
      model="ollama:qwen3",
      tools=[puml_to_utext],
  )
  results = agent.invoke({"messages": [
      {"role": "user",
       "content": """
       Render a PlantUML diagram for a contrived interaction in which Alice
       buys a coffee from Bob.
       """}]})
  print(results["messages"][-1].content)
#+end_src

#+RESULTS:
#+begin_example
Here is the rendered Unicode text for the PlantUML sequence diagram showing Alice buying coffee from Bob:

```
┌─────┐          ┌───┐
│Alice│          │Bob│
└──┬──┘          └─┬─┘
   │  Buy Coffee   │  
   │──────────────>│  
   │               │  
   │Prepare Coffee │  
   │<─ ─ ─ ─ ─ ─ ─ │  
   │               │  
   │     Pay       │  
   │──────────────>│  
   │               │  
   │Receive Coffee │  
   │<─ ─ ─ ─ ─ ─ ─ │  
┌──┴──┐          ┌─┴─┐
│Alice│          │Bob│
└─────┘          └───┘
```

This sequence diagram shows the four-step interaction:
1. Alice initiates the purchase
2. Bob prepares the coffee
3. Alice pays
4. Bob delivers the coffee
#+end_example
